[codd] - feat(docs): refatorar modelo logico com dbml e exportar svg
